benchmark/go-frameworks/results/20260924-101653/results/post/stdlib/r1/5000.txt
Running 40s test @ http://10.128.0.2:8081/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 0.893ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.890ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.881ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.877ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.880ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.891ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.884ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.880ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.902ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.891ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.892ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.895ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.885ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.880ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.879ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.906ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.91ms  405.80us   3.55ms   66.25%
    Req/Sec   327.55    109.87   555.00     64.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.90ms
 75.000%    1.17ms
 90.000%    1.45ms
 99.000%    1.91ms
 99.900%    2.12ms
 99.990%    2.42ms
 99.999%    3.36ms
100.000%    3.55ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.113     0.000000            1         1.00
       0.367     0.100000        14982         1.11
       0.518     0.200000        29863         1.25
       0.655     0.300000        44800         1.43
       0.783     0.400000        59765         1.67
       0.903     0.500000        74739         2.00
       0.958     0.550000        82152         2.22
       1.014     0.600000        89656         2.50
       1.067     0.650000        97112         2.86
       1.119     0.700000       104506         3.33
       1.172     0.750000       112035         4.00
       1.199     0.775000       115750         4.44
       1.228     0.800000       119464         5.00
       1.266     0.825000       123190         5.71
       1.315     0.850000       126853         6.67
       1.376     0.875000       130596         8.00
       1.409     0.887500       132469         8.89
       1.446     0.900000       134332        10.00
       1.485     0.912500       136174        11.43
       1.528     0.925000       138042        13.33
       1.576     0.937500       139901        16.00
       1.603     0.943750       140846        17.78
       1.631     0.950000       141774        20.00
       1.661     0.956250       142708        22.86
       1.692     0.962500       143632        26.67
       1.729     0.968750       144568        32.00
       1.749     0.971875       145029        35.56
       1.771     0.975000       145502        40.00
       1.795     0.978125       145962        45.71
       1.819     0.981250       146438        53.33
       1.847     0.984375       146900        64.00
       1.863     0.985938       147141        71.11
       1.880     0.987500       147369        80.00
       1.897     0.989062       147603        91.43
       1.915     0.990625       147832       106.67
       1.936     0.992188       148063       128.00
       1.948     0.992969       148183       142.22
       1.961     0.993750       148298       160.00
       1.973     0.994531       148413       182.86
       1.987     0.995313       148527       213.33
       2.003     0.996094       148645       256.00
       2.014     0.996484       148704       284.44
       2.023     0.996875       148760       320.00
       2.037     0.997266       148819       365.71
       2.049     0.997656       148877       426.67
       2.063     0.998047       148935       512.00
       2.073     0.998242       148964       568.89
       2.085     0.998437       148994       640.00
       2.095     0.998633       149023       731.43
       2.105     0.998828       149051       853.33
       2.117     0.999023       149085      1024.00
       2.125     0.999121       149095      1137.78
       2.135     0.999219       149111      1280.00
       2.147     0.999316       149125      1462.86
       2.155     0.999414       149138      1706.67
       2.163     0.999512       149153      2048.00
       2.173     0.999561       149162      2275.56
       2.177     0.999609       149167      2560.00
       2.187     0.999658       149174      2925.71
       2.195     0.999707       149182      3413.33
       2.227     0.999756       149189      4096.00
       2.237     0.999780       149194      4551.11
       2.247     0.999805       149196      5120.00
       2.287     0.999829       149200      5851.43
       2.335     0.999854       149204      6826.67
       2.395     0.999878       149207      8192.00
       2.423     0.999890       149210      9102.22
       2.431     0.999902       149211     10240.00
       2.467     0.999915       149213     11702.86
       2.573     0.999927       149215     13653.33
       2.581     0.999939       149216     16384.00
       2.593     0.999945       149217     18204.44
       2.635     0.999951       149218     20480.00
       2.643     0.999957       149219     23405.71
       2.691     0.999963       149220     27306.67
       2.695     0.999969       149221     32768.00
       2.695     0.999973       149221     36408.89
       2.951     0.999976       149222     40960.00
       2.951     0.999979       149222     46811.43
       2.969     0.999982       149223     54613.33
       2.969     0.999985       149223     65536.00
       2.969     0.999986       149223     72817.78
       3.357     0.999988       149224     81920.00
       3.357     0.999989       149224     93622.86
       3.357     0.999991       149224    109226.67
       3.357     0.999992       149224    131072.00
       3.357     0.999993       149224    145635.56
       3.551     0.999994       149225    163840.00
       3.551     1.000000       149225          inf
#[Mean    =        0.905, StdDeviation   =        0.406]
#[Max     =        3.550, Total count    =       149225]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  199898 requests in 40.00s, 32.58MB read
Requests/sec:   4997.23
Transfer/sec:    833.89KB